In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.preprocessing import MinMaxScaler, StandardScaler, OneHotEncoder
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score, train_test_split
from sklearn.ensemble import RandomForestClassifier, AdaBoostClassifier,GradientBoostingClassifier

In [2]:
pd.set_option('max_columns',None)
pd.set_option('max_rows',None)

# Dataset

In [3]:
df = pd.read_csv('./database/csv_files/Csv_titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Feature Preprocessing

In [6]:
# removing unnecessery features

df2 = df.drop(['PassengerId','Name','Ticket'], axis = 1)
df2.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [7]:
# Removing the column with most null value : Cabin

print(df2.isnull().mean()*100)

df3 = df2.drop('Cabin',axis = 1)
df3.head()

Survived     0.000000
Pclass       0.000000
Sex          0.000000
Age         19.865320
SibSp        0.000000
Parch        0.000000
Fare         0.000000
Cabin       77.104377
Embarked     0.224467
dtype: float64

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [8]:
# Removing all null rows from Embarked

df4 = df3.dropna(subset=['Embarked'])
df4.shape

(889, 8)

In [9]:
df3.shape

(891, 8)

# Changing catagorial variables to Numerical

In [10]:
# sex
df5 = df4.copy()

Sex = {'male' : 1,'female' : 0}

df5.Sex = df4.Sex.map(Sex)

In [23]:
ohe_Col = ['Q','S']

ohe = OneHotEncoder(drop='first', sparse=False, dtype= 'int64')
df6 = df5.drop('Embarked', axis = 1).join(pd.DataFrame(ohe.fit_transform(df5[['Embarked']]), columns=ohe_Col))

In [25]:
df6.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare    Q    S
0         0       3    1  22.0      1      0   7.2500  0.0  1.0
1         1       1    0  38.0      1      0  71.2833  0.0  0.0
2         1       3    0  26.0      0      0   7.9250  0.0  1.0
3         1       1    0  35.0      1      0  53.1000  0.0  1.0
4         0       3    1  35.0      0      0   8.0500  0.0  1.0

# Train Test Split

In [26]:
X_train, X_test, y_train, y_test = train_test_split(df6.drop('Survived', axis = 1),
                                                    df6.Survived,stratify=df6.Survived,train_size=0.8,random_state=45)

In [27]:
y_test.shape ,y_train.shape

((178,), (711,))

# Null value Imputation

In [28]:
# Imputing the Age column with the average

value = X_train.Age.mean()

X_train2 = X_train.fillna(value)
X_test2 = X_test.fillna(value)

# Normalization

In [29]:
scaler = MinMaxScaler()

X_train3 = pd.DataFrame(scaler.fit_transform(X_train2), columns=X_train2.columns)
X_test3 = pd.DataFrame(scaler.transform(X_test2), columns=X_test2.columns)

In [30]:
X_train3.head()

   Pclass  Sex       Age  SibSp  Parch      Fare         Q         S
0     0.0  1.0  0.367417    0.0    0.0  0.058556  0.000000  0.033538
1     1.0  0.0  0.180638    0.0    0.0  0.015672  0.033538  0.000000
2     1.0  1.0  0.470566    0.0    0.0  0.015412  0.033538  0.000000
3     1.0  1.0  0.470566    0.0    0.0  0.016908  0.000000  0.033538
4     1.0  1.0  0.546199    0.0    0.0  0.015713  0.000000  0.000000

# Bagging (Random Forest)

In [31]:
forest = RandomForestClassifier(n_estimators=500,random_state=45,oob_score=True)

forest.fit(X_train3,y_train)
forest.score(X_test3,y_test)

0.8314606741573034

In [33]:
forest.oob_score_

0.8115330520393812

In [37]:
scores = cross_val_score(forest,X_train3,y_train,cv = 10)
scores.mean()

0.8072769953051644

# Boosting

### AdaBoost

In [38]:
ada = AdaBoostClassifier(DecisionTreeClassifier(random_state=45), n_estimators= 500, learning_rate= 0.2, random_state=45)

ada.fit(X_train3,y_train)
ada.score(X_test3,y_test)

0.7865168539325843

In [39]:
scores = cross_val_score(ada,X_train3,y_train,cv = 10)
scores.mean()

0.7847613458528951

### Gradient Boost

In [44]:
GB = GradientBoostingClassifier(n_estimators= 500, learning_rate= 0.2, random_state=45, max_leaf_nodes = 8)

GB.fit(X_train3,y_train)
GB.score(X_test3,y_test)

0.8033707865168539

In [45]:
scores = cross_val_score(GB,X_train3,y_train,cv = 10)
scores.mean()

0.7889671361502347

### XGBoost

In [48]:
from xgboost import XGBClassifier

In [49]:
xgb = XGBClassifier()

xgb.fit(X_train3,y_train)
xgb.score(X_test3,y_test)

0.8258426966292135

In [50]:
scores = cross_val_score(xgb,X_train3,y_train,cv = 10)
scores.mean()

0.7960485133020344